In [2]:
import pandas as pd
import numpy as np

21. Write a Python program to show different methods
of converting python structures into Dataframes.

In [4]:
#Converting list to DataFrame
array = list(range(100))
pd.DataFrame(array).head()

   0
0  0
1  1
2  2
3  3
4  4

In [5]:
#Converting list of list to DataFrame
list_2d = [[1,2,3], [4,5,6]]
pd.DataFrame(list_2d).head()

   0  1  2
0  1  2  3
1  4  5  6

In [10]:
#Converting dictionary to DataFrame
df2 = pd.DataFrame({'India':['Sachin', 'Sehwag', 'Dravid'], 'Age':[29, 28, 29]})
df2

    India  Age
0  Sachin   29
1  Sehwag   28
2  Dravid   29

In [13]:
#Converting tuple to DataFrame
tuple_df = pd.DataFrame([(1,2,3),(4,5,6)])
tuple_df

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
#Converting list of dictionary to DataFrame
list_dict_df = pd.DataFrame([{"Name": "Sachin", 'Age': 29}, {"Name": "Sehwag", 'Age': 28}, {"Name": "Dravid", 'Age': 29}])
list_dict_df

   Age    Name
0   29  Sachin
1   28  Sehwag
2   29  Dravid

22. Write a Python program to convert a NumPy array to

In [18]:
np_array = np.random.randint(1,100, 10)
pd.Series(np_array, name='Numbers')

0    37
1    10
2    43
3    25
4    44
5    20
6    70
7    34
8    58
9    85
Name: Numbers, dtype: int32

23. Write a program to add and delete columns to a
Dataframe when a dictionary is provided.

In [28]:
data1 = pd.DataFrame({'one':[1, 2, 3]}, index=['a', 'b', 'c'])
data2 = pd.DataFrame({'two':[1, 2, 3, 4]}, index=['a', 'b', 'c', 'd'])
print(data1)
print(data2)

   one
a    1
b    2
c    3
   two
a    1
b    2
c    3
d    4

In [31]:
add_column_df = pd.concat([data1, data2], axis=1)

c:\python36_64\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [32]:
add_column_df.drop(columns=['two'])

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [38]:
#Adding a columns part-2
add_column_df['two'] = np.arange(1,5)
add_column_df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

24. Write a program to add and delete rows to a
Dataframe when a dictionary is provided.

In [40]:
data = pd.DataFrame({'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two':pd.Series([1, 2, 3, 4], 
                                                                    index=['a', 'b', 'c', 'd'])})
data

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [55]:
data.append([{"one":5, "two":5},{"one":6, "two":6}], ignore_index=True)

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4
4  5.0    5
5  6.0    6

In [58]:
# Appending a new dataframe as a row to an existing dataframe
row = pd.DataFrame([{"one":5, "two":5},{"one":6, "two":6}])
data.append(row,ignore_index=True)

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4
4  5.0    5
5  6.0    6

25. Write a Python program to import from JSON file

In [62]:
players_df = pd.read_json("Files\Players.json")
players_df

     Name  Age  Runs
0  Sachin   29  8000
1  Dravid   29  6000

26. Write a Python program to add, subtract, multiple
and divide two Pandas Series.

In [68]:
series_1 = pd.Series(np.arange(1,11), name='Series1')
series_2 = pd.Series(np.arange(11,21), name='Series2')
print(series_1)
print(series_2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Series1, dtype: int32
0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
9    20
Name: Series2, dtype: int32

In [72]:
# Adding Series
print(series_1 + series_2)

0    12
1    14
2    16
3    18
4    20
5    22
6    24
7    26
8    28
9    30
dtype: int32

In [73]:
#Subtracting Series
print(series_1 - series_2)

0   -10
1   -10
2   -10
3   -10
4   -10
5   -10
6   -10
7   -10
8   -10
9   -10
dtype: int32

In [74]:
#Multiplying Series
print(series_1 * series_2)

0     11
1     24
2     39
3     56
4     75
5     96
6    119
7    144
8    171
9    200
dtype: int32

In [75]:
#Dividing Series
print(series_1 / series_2)

0    0.090909
1    0.166667
2    0.230769
3    0.285714
4    0.333333
5    0.375000
6    0.411765
7    0.444444
8    0.473684
9    0.500000
dtype: float64

27. Write a Python program to change the data type of
given a column or a Series.

In [87]:
players_df = pd.read_json("Files\Players.json")
players_df.astype({'Runs':float, 'Age': float})

     Name   Age    Runs
0  Sachin  29.0  8000.0
1  Dravid  29.0  6000.0

28. Write a Python program to create a subset of a
given series based on value and condition.

In [90]:
numbers = pd.Series(np.arange(1,100), name='numbers')
numbers.head()

0    1
1    2
2    3
3    4
4    5
Name: numbers, dtype: int32

In [91]:
even_numbers = numbers[numbers%2==0]
even_numbers.head()

1     2
3     4
5     6
7     8
9    10
Name: numbers, dtype: int32

In [92]:
odd_numbers = numbers[numbers%2!=0]
odd_numbers.head()

0    1
2    3
4    5
6    7
8    9
Name: numbers, dtype: int32

29. Write a Python program to create the mean and
standard deviation of the data of a given Series.

In [93]:
numbers = pd.Series(np.arange(1,100), name='numbers')
numbers.head()

0    1
1    2
2    3
3    4
4    5
Name: numbers, dtype: int32

In [95]:
# mean, std
numbers.mean(), numbers.std()

(50.0, 28.722813232690143)

30. Write a Python program to change the order of
index of a given series.

In [96]:
numbers = pd.Series(np.arange(1,100), name='numbers')
numbers.head()

0    1
1    2
2    3
3    4
4    5
Name: numbers, dtype: int32

In [97]:
numbers.index = numbers.index[::-1]
numbers.head()

98    1
97    2
96    3
95    4
94    5
Name: numbers, dtype: int32

In [103]:
numbers = pd.Series([1,2,3,4,5], name='numbers', index = ['A','B','C','D','E'])
numbers

A    1
B    2
C    3
D    4
E    5
Name: numbers, dtype: int64

In [104]:
r = numbers.reindex(index = ['B','A','E','D','C'])
r

B    2
A    1
E    5
D    4
C    3
Name: numbers, dtype: int64

31. Write a Python program to convert a given Series to
an array.

In [107]:
numbers = pd.Series([1,2,3,4,5], name='numbers', index = ['A','B','C','D','E'])
numbers.values

array([1, 2, 3, 4, 5], dtype=int64)

In [106]:
np.array(numbers)

array([1, 2, 3, 4, 5], dtype=int64)

32. Write a Python program to convert Series of lists to one Series.

In [108]:
numbers = pd.Series([[1,2,3], [4,5,6], [7,8,9]])
numbers

0    [1, 2, 3]
1    [4, 5, 6]
2    [7, 8, 9]
dtype: object

In [111]:
numbers.apply(pd.Series).stack().reset_index(drop=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [6]:
numbers = pd.Series(np.random.randint(1,100, 10))
numbers

0    10
1    99
2    95
3    12
4    52
5    26
6     7
7    35
8    58
9    67
dtype: int32

In [8]:
#sort ascending
print(numbers.sort_values())
#sort descending
print(numbers.sort_values(ascending=False))

6     7
0    10
3    12
5    26
7    35
4    52
8    58
9    67
2    95
1    99
dtype: int32
1    99
2    95
9    67
8    58
4    52
7    35
5    26
3    12
0    10
6     7
dtype: int32

34. Write a Python program to sort the DataFrame first
by 'name' in descending order, then by 'score' in
ascending order using pandas.

In [20]:
 exam_data=pd.DataFrame({
     'name':['Anastasia','Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],
     'score': [10, 12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
     'attempts': [1, 1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
     'qualify': ['yes','yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no','yes']})
exam_data

         name  score  attempts qualify
0   Anastasia   10.0         1     yes
1   Anastasia   12.5         1     yes
2        Dima    9.0         3      no
3   Katherine   16.5         2     yes
4       James    NaN         3      no
5       Emily    9.0         2      no
6     Michael   20.0         3     yes
7     Matthew   14.5         1     yes
8       Laura    NaN         1      no
9       Kevin    8.0         2      no
10      Jonas   19.0         1     yes

In [25]:
exam_data.sort_values(by=['name','score'], ascending=[False, True])

         name  score  attempts qualify
6     Michael   20.0         3     yes
7     Matthew   14.5         1     yes
8       Laura    NaN         1      no
9       Kevin    8.0         2      no
3   Katherine   16.5         2     yes
10      Jonas   19.0         1     yes
4       James    NaN         3      no
5       Emily    9.0         2      no
2        Dima    9.0         3      no
0   Anastasia   10.0         1     yes
1   Anastasia   12.5         1     yes

35. Write a Python program to set a given value for
particular cell in DataFrame using index value.

In [26]:
exam_data=pd.DataFrame({'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no',
'yes']})
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [27]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_data['label'] = labels
exam_data

        name  score  attempts qualify label
0  Anastasia   12.5         1     yes     a
1       Dima    9.0         3      no     b
2  Katherine   16.5         2     yes     c
3      James    NaN         3      no     d
4      Emily    9.0         2      no     e
5    Michael   20.0         3     yes     f
6    Matthew   14.5         1     yes     g
7      Laura    NaN         1      no     h
8      Kevin    8.0         2      no     i
9      Jonas   19.0         1     yes     j

In [40]:
#changing a particular index cell to some value
exam_data.loc[5,'attempts'] = 5
exam_data

,name,score,attempts,qualify,label,"(5, attempt)",attempt,"(5, attempts)"
0,Anastasia,12.5,1,yes,a,2,NaN,5
1,Dima,9.0,3,no,b,2,NaN,5
2,Katherine,16.5,2,yes,c,2,NaN,5
3,James,NaN,3,no,d,2,NaN,5
4,Emily,9.0,2,no,e,2,NaN,5
5,Michael,20.0,5,yes,f,2,2.0,5
6,Matthew,14.5,1,yes,g,2,NaN,5
7,Laura,NaN,1,no,h,2,NaN,5
8,Kevin,8.0,2,no,i,2,NaN,5
9,Jonas,19.0,1,yes,j,2,NaN,5

36. Write a Python program to find whether a year in the
dataframe is a leap year or not.

In [45]:
import datetime
dat=input("Enter date in YYYY-MM-DD HH:MM:SS format: ")
prd=int(input("Period of years: "))
date1 = pd.Series(pd.date_range(dat, periods=prd, freq='Y'))
df = pd.DataFrame(dict(date_given=date1))
df

Enter date in YYYY-MM-DD HH:MM:SS format:  2021-06-02 09:17:00
Period of years:  10

           date_given
0 2021-12-31 09:17:00
1 2022-12-31 09:17:00
2 2023-12-31 09:17:00
3 2024-12-31 09:17:00
4 2025-12-31 09:17:00
5 2026-12-31 09:17:00
6 2027-12-31 09:17:00
7 2028-12-31 09:17:00
8 2029-12-31 09:17:00
9 2030-12-31 09:17:00

In [47]:
df[df.date_given.dt.is_leap_year]

           date_given
3 2024-12-31 09:17:00
7 2028-12-31 09:17:00

37. Write code to calculate Log and natural Logarithmic
value of a column in pandas python.

In [51]:
df = pd.DataFrame(np.arange(1,11), columns=['number'])
df

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [55]:
df['log_value'] = np.log(df['number'])
df['log_value2'] = np.log2(df['number'])
df['log_value10'] = np.log10(df['number'])

In [56]:
df

   number  log_value  log_value2  log_value10
0       1   0.000000    0.000000     0.000000
1       2   0.693147    1.000000     0.301030
2       3   1.098612    1.584963     0.477121
3       4   1.386294    2.000000     0.602060
4       5   1.609438    2.321928     0.698970
5       6   1.791759    2.584963     0.778151
6       7   1.945910    2.807355     0.845098
7       8   2.079442    3.000000     0.903090
8       9   2.197225    3.169925     0.954243
9      10   2.302585    3.321928     1.000000

38. Develop a code to find the difference between two
Timestamps in Seconds, Minutes, hours and
nanoseconds in Pandas Python.

In [82]:
import pandas as pd
import numpy as np
import datetime
from dateutil.relativedelta import relativedelta
from datetime import date
date1 = pd.Series(pd.date_range('2012-1-1 12:00:00', periods=7, freq='M'))
date2 = pd.Series(pd.date_range('2013-3-11 21:45:00', periods=7, freq='W'))
df = pd.DataFrame(dict(Start_date = date1, End_date = date2))
df

           Start_date            End_date
0 2012-01-31 12:00:00 2013-03-17 21:45:00
1 2012-02-29 12:00:00 2013-03-24 21:45:00
2 2012-03-31 12:00:00 2013-03-31 21:45:00
3 2012-04-30 12:00:00 2013-04-07 21:45:00
4 2012-05-31 12:00:00 2013-04-14 21:45:00
5 2012-06-30 12:00:00 2013-04-21 21:45:00
6 2012-07-31 12:00:00 2013-04-28 21:45:00

In [86]:
df['difference'] = df['End_date'] - df['Start_date']
df['seconds'] = df['difference']/np.timedelta64(1,'s')
df['hours'] = df['difference']/np.timedelta64(1,'h')
df['ns'] = df['difference']/np.timedelta64(1,'ns')
df

,Start_date,End_date,seconds,difference,hours,ns
0,2012-01-31 12:00:00,2013-03-17 21:45:00,35545500.0,411 days 09:45:00,9873.75,3.554550e+16
1,2012-02-29 12:00:00,2013-03-24 21:45:00,33644700.0,389 days 09:45:00,9345.75,3.364470e+16
2,2012-03-31 12:00:00,2013-03-31 21:45:00,31571100.0,365 days 09:45:00,8769.75,3.157110e+16
3,2012-04-30 12:00:00,2013-04-07 21:45:00,29583900.0,342 days 09:45:00,8217.75,2.958390e+16
4,2012-05-31 12:00:00,2013-04-14 21:45:00,27510300.0,318 days 09:45:00,7641.75,2.751030e+16
5,2012-06-30 12:00:00,2013-04-21 21:45:00,25523100.0,295 days 09:45:00,7089.75,2.552310e+16
6,2012-07-31 12:00:00,2013-04-28 21:45:00,23449500.0,271 days 09:45:00,6513.75,2.344950e+16

39. Write a Python program to change one value to another value in name column of the data frame.

In [90]:
exam_data = {'name': ['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'], 
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [91]:
df['name'] = df['name'].replace('Dima', 'Lima')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Lima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

40. Write a NumPy program to remove the leading and
trailing whitespaces of all the elements of a given
array.

In [92]:
array = np.array([' python exercises ', ' PHP ', ' java ', ' C++'], dtype=np.str)
array

array([' python exercises ', ' PHP ', ' java ', ' C++'], dtype='<U18')

In [95]:
np.str.lstrip()

AttributeError: 'numpy.ndarray' object has no attribute 'lstrip'

In [97]:
[np.str.lstrip(char) for char in array]

['python exercises ', 'PHP ', 'java ', 'C++']

In [98]:
[np.str.rstrip(char) for char in array]

[' python exercises', ' PHP', ' java', ' C++']

In [99]:
[np.str.strip(char) for char in array]

['python exercises', 'PHP', 'java', 'C++']

In [100]:
np.char.strip(array)

array(['python exercises', 'PHP', 'java', 'C++'], dtype='<U18')